/*Сравнение чисел
Напишите программу, сравнивающую два целых числа.
Входные данные:
Два целых числа x, y
Выходные данные:
1 -- если x=y
0 -- если x=y
*/

#include <stdio.h>

int main (void){
    int x,y,bul=0;
    scanf("%d %d", &x, &y);
    if (x==y){
        bul=1;
        printf("%d", bul);
    } else {
        printf("%d", bul);
    }
    
        
}

